Repository: KickNext/pos_printer_manager
Catalog: lib/l10n/intl_*.arb
Languages: es_pr, ru_ru

source: Printer Details
es_pr: Detalles de la Impresora
ru_ru: Информация о принтере

source: Rename Printer
es_pr: Renombrar Impresora
ru_ru: Переименовать принтер

source: Printer Name
es_pr: Nombre de la Impresora
ru_ru: Название принтера

# pleaseEnterName
source: Please enter a name
es_pr: Por favor, ingrese un nombre
ru_ru: Пожалуйста, введите название

source: Save
es_pr: Guardar
ru_ru: Сохранить

source: Cancel
es_pr: Cancelar
ru_ru: Отмена

source: Close
es_pr: Cerrar
ru_ru: Закрыть

source: Back
es_pr: Atrás
ru_ru: Назад

source: Next
es_pr: Siguiente
ru_ru: Далее

source: Create
es_pr: Crear
ru_ru: Создать

source: Confirm
es_pr: Confirmar
ru_ru: Подтвердить

source: Remove
es_pr: Eliminar
ru_ru: Удалить

source: Remove Printer
es_pr: Eliminar Impresora
ru_ru: Удалить принтер

# removePrinterQuestion
source: Remove Printer?
es_pr: ¿Eliminar Impresora?
ru_ru: Удалить принтер?

# removePrinterConfirmation
source: This will remove the printer and all its configuration. You can add it again later.
es_pr: Esto eliminará la impresora y toda su configuración. Puede agregarla nuevamente más tarde.
ru_ru: Это удалит принтер и все его настройки. Вы сможете добавить его снова позже.

source: Disconnect
es_pr: Desconectar
ru_ru: Отключить

# disconnectPrinterQuestion
source: Disconnect Printer?
es_pr: ¿Desconectar Impresora?
ru_ru: Отключить принтер?

# disconnectPrinterConfirmation
source: This will remove the current connection settings. You can reconnect later.
es_pr: Esto eliminará la configuración de conexión actual. Puede reconectarse más tarde.
ru_ru: Это удалит текущие настройки подключения. Вы сможете подключиться снова позже.

source: Connect
es_pr: Conectar
ru_ru: Подключить

source: Change
es_pr: Cambiar
ru_ru: Изменить

source: Retry
es_pr: Reintentar
ru_ru: Повторить

source: Refresh
es_pr: Actualizar
ru_ru: Обновить

source: Test Print
es_pr: Prueba de Impresión
ru_ru: Тестовая печать

source: Printing...
es_pr: Imprimiendo...
ru_ru: Печать...

source: Diagnostics
es_pr: Diagnósticos
ru_ru: Диагностика

source: Diagnosing...
es_pr: Diagnosticando...
ru_ru: Диагностика...

source: Clear Error
es_pr: Limpiar Error
ru_ru: Очистить ошибку

source: Ready to Print
es_pr: Lista para Imprimir
ru_ru: Последний тест успешен

source: Connection Error
es_pr: Error de Conexión
ru_ru: Ошибка подключения

source: Not Connected
es_pr: No Conectada
ru_ru: Не подключен

source: Troubleshooting Tips
es_pr: Consejos de Solución de Problemas
ru_ru: Советы по устранению неполадок

# tipCheckPowerOn
source: Check that the printer is powered on
es_pr: Verifique que la impresora esté encendida
ru_ru: Убедитесь, что принтер включен

# tipUsbCable
source: For USB: Ensure cable is securely connected
es_pr: Para USB: Asegúrese de que el cable esté bien conectado
ru_ru: Для USB: Убедитесь, что кабель надёжно подключен

# tipNetworkConnection
source: For Network: Verify WiFi/Ethernet connection
es_pr: Para Red: Verifique la conexión WiFi/Ethernet
ru_ru: Для сети: Проверьте подключение WiFi/Ethernet

# tipCheckPaper
source: Check that paper is loaded correctly
es_pr: Verifique que el papel esté cargado correctamente
ru_ru: Убедитесь, что бумага загружена правильно

# tipCheckLabels
source: Ensure labels are loaded properly
es_pr: Asegúrese de que las etiquetas estén cargadas correctamente
ru_ru: Убедитесь, что этикетки загружены правильно

# tipCheckAndroBarNetwork
source: Check network connectivity to AndroBar device
es_pr: Verifique la conectividad de red al dispositivo AndroBar
ru_ru: Проверьте сетевое подключение к устройству AndroBar

source: Danger Zone
es_pr: Zona de Peligro
ru_ru: Опасная зона

# dangerZoneDescription
source: Removing this printer will delete all its configuration. You can add it again later, but you will need to reconfigure it.
es_pr: Eliminar esta impresora borrará toda su configuración. Puede agregarla nuevamente más tarde, pero deberá reconfigurarla.
ru_ru: Удаление этого принтера удалит все его настройки. Вы сможете добавить его снова позже, но вам потребуется заново настроить его.

source: Additional Settings
es_pr: Configuraciones Adicionales
ru_ru: Дополнительные настройки

source: Add Printer
es_pr: Agregar Impresora
ru_ru: Добавить принтер

source: Select printer type
es_pr: Seleccione el tipo de impresora
ru_ru: Выберите тип принтера

# selectPrinterTypeDescription
source: Choose the type of printer you want to add.
es_pr: Elija el tipo de impresora que desea agregar.
ru_ru: Выберите тип принтера, который хотите добавить.

source: Name your printer
es_pr: Nombre su impresora
ru_ru: Назовите принтер

# nameYourPrinterDescription
source: Give your printer a descriptive name to identify it easily.
es_pr: Dele a su impresora un nombre descriptivo para identificarla fácilmente.
ru_ru: Дайте принтеру понятное название для лёгкой идентификации.

# printerNameHint
source: e.g., Kitchen Display, Bar Printer
es_pr: ej., Display de Cocina, Impresora del Bar
ru_ru: напр., Кухонный дисплей, Принтер бара

# printerDefaultName
source: Printer {number}
es_pr: Impresora {number}
ru_ru: Принтер {number}

# configureConnectionLater
source: You can configure connection after creation
es_pr: Puede configurar la conexión después de crearla
ru_ru: Вы сможете настроить подключение после создания

# pleaseSelectPrinterType
source: Please select a printer type
es_pr: Por favor, seleccione un tipo de impresora
ru_ru: Пожалуйста, выберите тип принтера

# failedToCreatePrinter
source: Failed to create printer: {error}
es_pr: Error al crear la impresora: {error}
ru_ru: Не удалось создать принтер: {error}

# stepType
source: Type
es_pr: Tipo
ru_ru: Тип

# stepName
source: Name
es_pr: Nombre
ru_ru: Название

source: Ready to Connect
es_pr: Lista para Conectar
ru_ru: Готов к подключению

# readyToConnectDescription
source: Your printer has been created. You can now configure the connection.
es_pr: Su impresora ha sido creada. Ahora puede configurar la conexión.
ru_ru: Принтер создан. Теперь вы можете настроить подключение.

source: Receipt Printer
es_pr: Impresora de Recibos
ru_ru: Чековый принтер

# receiptPrinterDescription
source: For receipts and bills
es_pr: Para recibos y facturas
ru_ru: Для чеков и счетов

source: Kitchen Printer
es_pr: Impresora de Cocina
ru_ru: Кухонный принтер

# kitchenPrinterDescription
source: For kitchen orders
es_pr: Para órdenes de cocina
ru_ru: Для кухонных заказов

source: Label Printer
es_pr: Impresora de Etiquetas
ru_ru: Принтер этикеток

# labelPrinterDescription
source: For product labels
es_pr: Para etiquetas de productos
ru_ru: Для этикеток товаров

# androBarDescription
source: Bar display system
es_pr: Sistema de pantalla del bar
ru_ru: Система отображения бара

source: Find Printers
es_pr: Buscar Impresoras
ru_ru: Найти принтеры

source: Searching for printers...
es_pr: Buscando impresoras...
ru_ru: Поиск принтеров...

# foundPrinters
source: Found {count} printer(s)
es_pr: Se encontraron {count} impresora(s)
ru_ru: Найдено принтеров: {count}

source: Scanning network and USB...
es_pr: Escaneando red y USB...
ru_ru: Сканирование сети и USB...

source: No Printers Found
es_pr: No Se Encontraron Impresoras
ru_ru: Принтеры не найдены

# noPrintersFoundDescription
source: Make sure your printer is powered on and connected to the same network or via USB.
es_pr: Asegúrese de que su impresora esté encendida y conectada a la misma red o por USB.
ru_ru: Убедитесь, что принтер включен и подключен к той же сети или через USB.

source: Search Again
es_pr: Buscar de Nuevo
ru_ru: Искать снова

source: No Printers Available
es_pr: No Hay Impresoras Disponibles
ru_ru: Нет доступных принтеров

# maxPrintersReached
source: Maximum number of printers reached.
es_pr: Se alcanzó el número máximo de impresoras.
ru_ru: Достигнуто максимальное количество принтеров.

source: No Printers Configured
es_pr: No Hay Impresoras Configuradas
ru_ru: Принтеры не настроены

# addPrinterToStart
source: Add a printer to get started.
es_pr: Agregue una impresora para comenzar.
ru_ru: Добавьте принтер для начала работы.

source: No Connection
es_pr: Sin Conexión
ru_ru: Нет подключения

# noConnectionDescription
source: No printer is connected. Search for available printers to configure the connection.
es_pr: No hay impresora conectada. Busque impresoras disponibles para configurar la conexión.
ru_ru: Принтер не подключен. Найдите доступные принтеры для настройки подключения.

source: USB Connection
es_pr: Conexión USB
ru_ru: USB подключение

source: Network Connection
es_pr: Conexión de Red
ru_ru: Сетевое подключение

source: Network
es_pr: Red
ru_ru: Сеть

source: Unknown
es_pr: Desconocido
ru_ru: Неизвестно

source: Manufacturer
es_pr: Fabricante
ru_ru: Производитель

source: Product Name
es_pr: Nombre del Producto
ru_ru: Название продукта

source: Serial Number
es_pr: Número de Serie
ru_ru: Серийный номер

source: IP Address
es_pr: Dirección IP
ru_ru: IP-адрес

source: Subnet Mask
es_pr: Máscara de Subred
ru_ru: Маска подсети

source: Gateway
es_pr: Puerta de Enlace
ru_ru: Шлюз

source: MAC Address
es_pr: Dirección MAC
ru_ru: MAC-адрес

source: Enabled
es_pr: Habilitado
ru_ru: Включено

source: Disabled
es_pr: Deshabilitado
ru_ru: Отключено

source: Network Settings
es_pr: Configuración de Red
ru_ru: Сетевые настройки

# ipAddressRequired
source: IP Address is required
es_pr: Se requiere dirección IP
ru_ru: IP-адрес обязателен

source: Save Settings
es_pr: Guardar Configuración
ru_ru: Сохранить настройки

# networkSettingsUpdated
source: Network settings updated successfully
es_pr: Configuración de red actualizada exitosamente
ru_ru: Сетевые настройки успешно обновлены

# macAddressRequired
source: MAC address required for network configuration
es_pr: Se requiere dirección MAC para la configuración de red
ru_ru: MAC-адрес требуется для сетевой настройки

source: USB Permission
es_pr: Permiso USB
ru_ru: USB разрешение

source: Grant USB Permission
es_pr: Otorgar Permiso USB
ru_ru: Предоставить USB разрешение

source: Requesting...
es_pr: Solicitando...
ru_ru: Запрос...

source: Permission Granted
es_pr: Permiso Otorgado
ru_ru: Разрешение получено

source: Permission Denied
es_pr: Permiso Denegado
ru_ru: Разрешение отклонено

source: Permission Required
es_pr: Se Requiere Permiso
ru_ru: Требуется разрешение

source: No Permission Needed
es_pr: No Se Necesita Permiso
ru_ru: Разрешение не требуется

# usbPermissionGrantedMessage
source: USB permission granted. Printer is ready to use.
es_pr: Permiso USB otorgado. La impresora está lista para usar.
ru_ru: USB разрешение получено. Принтер готов к использованию.

# usbPermissionDeniedMessage
source: USB permission was denied. Please grant permission to use this printer.
es_pr: El permiso USB fue denegado. Por favor, otorgue el permiso para usar esta impresora.
ru_ru: USB разрешение было отклонено. Предоставьте разрешение для использования принтера.

# usbPermissionRequiredMessage
source: USB permission is required to communicate with this printer.
es_pr: Se requiere permiso USB para comunicarse con esta impresora.
ru_ru: USB разрешение требуется для связи с этим принтером.

# noUsbPermissionNeededMessage
source: No USB permission required for network printers.
es_pr: No se requiere permiso USB para impresoras de red.
ru_ru: USB разрешение не требуется для сетевых принтеров.

# usbPermissionDeniedError
source: USB permission denied
es_pr: Permiso USB denegado
ru_ru: USB разрешение отклонено

# usbPermissionGrantedSuccess
source: USB permission granted
es_pr: Permiso USB otorgado
ru_ru: USB разрешение получено

# usbPermissionGrantedWithDevice
source: USB permission granted: {deviceInfo}
es_pr: Permiso USB otorgado: {deviceInfo}
ru_ru: USB разрешение получено: {deviceInfo}

# diagnosticsProblemsFound
source: Problems Found
es_pr: Se Encontraron Problemas
ru_ru: Обнаружены проблемы

# diagnosticsAllPassed
source: All Checks Passed
es_pr: Todas las Pruebas Pasaron
ru_ru: Все проверки пройдены

# diagnosticsProblemsDescription
source: Some diagnostic checks failed. Review the issues below and follow the suggestions to resolve them.
es_pr: Algunas pruebas de diagnóstico fallaron. Revise los problemas a continuación y siga las sugerencias para resolverlos.
ru_ru: Некоторые диагностические проверки не пройдены. Изучите проблемы ниже и следуйте рекомендациям для их устранения.

# diagnosticsSuccessDescription
source: All diagnostic checks passed successfully. Your printer is configured correctly.
es_pr: Todas las pruebas de diagnóstico pasaron exitosamente. Su impresora está configurada correctamente.
ru_ru: Все диагностические проверки пройдены успешно. Принтер настроен правильно.

source: Connection Configuration
es_pr: Configuración de Conexión
ru_ru: Настройка подключения

# noConnectionConfigured
source: No connection configured. Please set up USB or Network connection first.
es_pr: No hay conexión configurada. Por favor, configure la conexión USB o de red primero.
ru_ru: Подключение не настроено. Сначала настройте USB или сетевое подключение.

# useFinderToConnect
source: Use the "Find Printers" button to configure connection.
es_pr: Use el botón "Buscar Impresoras" para configurar la conexión.
ru_ru: Используйте кнопку "Найти принтеры" для настройки подключения.

# connectionParamsConfigured
source: Connection parameters are configured ({connectionType}).
es_pr: Los parámetros de conexión están configurados ({connectionType}).
ru_ru: Параметры подключения настроены ({connectionType}).

# usbPermissionCheck
source: USB Permission
es_pr: Permiso USB
ru_ru: USB разрешение

# usbPermissionGrantedDiag
source: USB permission granted.
es_pr: Permiso USB otorgado.
ru_ru: USB разрешение получено.

source: USB permission not granted.
es_pr: Permiso USB no otorgado.
ru_ru: USB разрешение не получено.

# grantUsbPermissionSuggestion
source: Grant USB permission by clicking "Grant USB Permission" button.
es_pr: Otorgue el permiso USB haciendo clic en el botón "Otorgar Permiso USB".
ru_ru: Предоставьте USB разрешение, нажав кнопку "Предоставить USB разрешение".

# couldNotCheckUsbPermission
source: Could not check USB permission: {error}
es_pr: No se pudo verificar el permiso USB: {error}
ru_ru: Не удалось проверить USB разрешение: {error}

# tryReconnectingUsb
source: Try reconnecting the USB device.
es_pr: Intente reconectar el dispositivo USB.
ru_ru: Попробуйте переподключить USB устройство.

source: Not required for network printers.
es_pr: No requerido para impresoras de red.
ru_ru: Не требуется для сетевых принтеров.

source: Printer Connectivity
es_pr: Conectividad de Impresora
ru_ru: Связь с принтером

# printerRespondedSuccessfully
source: Printer responded successfully to test command.
es_pr: La impresora respondió exitosamente al comando de prueba.
ru_ru: Принтер успешно ответил на тестовую команду.

# printerTestFailed
source: Printer test failed: {error}
es_pr: La prueba de impresora falló: {error}
ru_ru: Тест принтера не пройден: {error}

# suggestionGrantPermission
source: Grant USB permission and try again.
es_pr: Otorgue el permiso USB e intente nuevamente.
ru_ru: Предоставьте USB разрешение и повторите попытку.

# suggestionCheckPowerAndConnection
source: Check that the printer is powered on and connected. Try reconnecting.
es_pr: Verifique que la impresora esté encendida y conectada. Intente reconectar.
ru_ru: Убедитесь, что принтер включен и подключен. Попробуйте переподключить.

# suggestionVerifyPrinterConnected
source: Verify the printer is connected and visible to the device.
es_pr: Verifique que la impresora esté conectada y visible para el dispositivo.
ru_ru: Убедитесь, что принтер подключен и виден устройству.

# suggestionCheckNetworkAndIp
source: Check network connection and printer IP address.
es_pr: Verifique la conexión de red y la dirección IP de la impresora.
ru_ru: Проверьте сетевое подключение и IP-адрес принтера.

# suggestionLoadPaper
source: Load paper into the printer.
es_pr: Cargue papel en la impresora.
ru_ru: Загрузите бумагу в принтер.

# suggestionCheckConnection
source: Check printer connection and configuration.
es_pr: Verifique la conexión y configuración de la impresora.
ru_ru: Проверьте подключение и настройки принтера.

# runDiagnosticsTooltip
source: Run full diagnostics and show problems if any
es_pr: Ejecutar diagnósticos completos y mostrar problemas si los hay
ru_ru: Запустить полную диагностику и показать проблемы, если они есть

# diagnosticsSomeFailed
source: Some diagnostic checks failed. Review the issues below and follow the suggestions to resolve them.
es_pr: Algunas pruebas de diagnóstico fallaron. Revise los problemas a continuación y siga las sugerencias para resolverlos.
ru_ru: Некоторые диагностические проверки не пройдены. Изучите проблемы ниже и следуйте рекомендациям для их устранения.

# diagnosticsAllPassedDescription
source: All diagnostic checks passed successfully. Your printer is configured correctly.
es_pr: Todas las pruebas de diagnóstico pasaron exitosamente. Su impresora está configurada correctamente.
ru_ru: Все диагностические проверки пройдены успешно. Принтер настроен правильно.

# useFindPrintersButton
source: Use the "Find Printers" button to configure connection.
es_pr: Use el botón "Buscar Impresoras" para configurar la conexión.
ru_ru: Используйте кнопку "Найти принтеры" для настройки подключения.

# usbPermissionGrantedShort
source: USB permission granted.
es_pr: Permiso USB otorgado.
ru_ru: USB разрешение получено.

# networkSettingsTooltip
source: Configure IP, subnet mask, gateway
es_pr: Configurar IP, máscara de subred, puerta de enlace
ru_ru: Настроить IP, маску подсети, шлюз

# usbPermissionNotRequiredMessage
source: No USB permission required for network printers.
es_pr: No se requiere permiso USB para impresoras de red.
ru_ru: USB разрешение не требуется для сетевых принтеров.

# suggestionGrantUsbPermission
source: Grant USB permission and try again.
es_pr: Otorgue el permiso USB e intente nuevamente.
ru_ru: Предоставьте USB разрешение и повторите попытку.

source: Enable DHCP
ru_ru: Включить DHCP

# enableDhcpDescription
source: Automatically obtain IP address from network
ru_ru: Автоматически получать IP-адрес из сети

# staticIpSettings
source: Static IP Configuration
ru_ru: Статический IP-адрес

# dhcpEnabled
source: DHCP is enabled. The printer will automatically obtain network settings from your router.
ru_ru: DHCP включен. Принтер автоматически получит сетевые настройки от вашего роутера.

# dhcpRequiresMac
source: MAC address is required to configure DHCP via network
ru_ru: MAC-адрес требуется для настройки DHCP через сеть

# networkSettingsAppliedTitle
source: Network Settings Sent
ru_ru: Сетевые настройки отправлены

# networkSettingsAppliedMessage
source: Network settings have been sent to the printer. Please restart the printer for changes to take effect.
ru_ru: Сетевые настройки отправлены на принтер. Перезагрузите принтер для применения изменений.

# networkSettingsDhcpAppliedMessage
source: DHCP has been enabled. After restarting, the printer will obtain a new IP address from your router.
ru_ru: DHCP включен. После перезагрузки принтер получит новый IP-адрес от вашего роутера.

# networkSettingsStaticIpAppliedMessage
source: Static IP ({ipAddress}) has been configured. After restarting, the printer will use this address.
ru_ru: Настроен статический IP ({ipAddress}). После перезагрузки принтер будет использовать этот адрес.

# restartPrinterRequired
source: Printer Restart Required
ru_ru: Требуется перезагрузка принтера

# pendingRebootWarning
source: Network settings were changed. The printer must be restarted for changes to take effect.
ru_ru: Сетевые настройки были изменены. Принтер необходимо перезагрузить для применения изменений.

# reconnectAfterRestart
source: After restarting the printer, use "Find Printers" to reconnect with the new settings.
ru_ru: После перезагрузки принтера используйте «Найти принтеры» для подключения с новыми настройками.

# testingBlockedPendingReboot
source: Testing is unavailable until the printer is restarted and reconnected.
ru_ru: Тестирование недоступно, пока принтер не будет перезагружен и переподключён.

# diagnosticsBlockedPendingReboot
source: Diagnostics is unavailable until the printer is restarted and reconnected.
ru_ru: Диагностика недоступна, пока принтер не будет перезагружен и переподключён.

# resetConnectionAndReconnect
source: Reset Connection
ru_ru: Сбросить подключение

# resetConnectionConfirmation
source: This will remove the current connection. After restarting the printer, search for it again using "Find Printers".
ru_ru: Это удалит текущее подключение. После перезагрузки принтера найдите его снова через «Найти принтеры».

# printerRestartInstructions
source: 1. Turn off the printer 2. Wait 10 seconds 3. Turn on the printer 4. Click "Reset Connection" below 5. Use "Find Printers" to reconnect
ru_ru: 1. Выключите принтер 2. Подождите 10 секунд 3. Включите принтер 4. Нажмите «Сбросить подключение» ниже 5. Используйте «Найти принтеры» для переподключения

source: Understood
ru_ru: Понятно

# usbConnectionStillWorks
source: USB connection will continue to work normally.
ru_ru: USB-подключение продолжит работать без изменений.

source: Vendor ID
es_pr: ID de Proveedor

source: Product ID
es_pr: ID de Producto
